In [1]:

import numpy as np
import pandas as pd

people = {
    "first": ['Victor', 'Cynthia', 'Eugene','Chris', np.nan, None, 'NA'],
    "second": ['Kituku', 'Kituku','Kituku', 'Schafer', np.nan, np.nan, 'Missing'],
    "email": ['vkituku@gmail.com', 'Ckituku@gmail.com', 'Ekituku@gmail.com', None, np.nan, 'anonymous@email.com', 'NA'],
    "age": ['33', '26','18','50', None, None, 'Missing']
}
df = pd.DataFrame(people)
for ms_v in ['NA', 'Missing']:
    df.replace(ms_v, np.nan, inplace=True)
type(df['email'])
df

# type(df)

C:\Users\victo\AppData\Local\Temp\ipykernel_2180\3881141929.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

     first   second                email   age
0   Victor   Kituku    vkituku@gmail.com    33
1  Cynthia   Kituku    Ckituku@gmail.com    26
2   Eugene   Kituku    Ekituku@gmail.com    18
3    Chris  Schafer                 None    50
4      NaN      NaN                  NaN  None
5     None      NaN  anonymous@email.com  None
6      NaN      NaN                  NaN   NaN

In [2]:
#Access select columns
df

     first   second                email   age
0   Victor   Kituku    vkituku@gmail.com    33
1  Cynthia   Kituku    Ckituku@gmail.com    26
2   Eugene   Kituku    Ekituku@gmail.com    18
3    Chris  Schafer                 None    50
4      NaN      NaN                  NaN  None
5     None      NaN  anonymous@email.com  None
6      NaN      NaN                  NaN   NaN

In [3]:
#loc and iloc for getting rows in pandas
#iloc uses integer/indexes

df.iloc[[0,1], [1,2]]

   second              email
0  Kituku  vkituku@gmail.com
1  Kituku  Ckituku@gmail.com

In [4]:
#loc uses labels
df.loc[[0,1],['email','first']]

               email    first
0  vkituku@gmail.com   Victor
1  Ckituku@gmail.com  Cynthia

In [5]:
# df.reset_index(inplace = True)
df.loc[[0,1],['first']]

     first
0   Victor
1  Cynthia

In [6]:
df

     first   second                email   age
0   Victor   Kituku    vkituku@gmail.com    33
1  Cynthia   Kituku    Ckituku@gmail.com    26
2   Eugene   Kituku    Ekituku@gmail.com    18
3    Chris  Schafer                 None    50
4      NaN      NaN                  NaN  None
5     None      NaN  anonymous@email.com  None
6      NaN      NaN                  NaN   NaN

In [7]:
df.dropna(axis='columns', how = 'all')

     first   second                email   age
0   Victor   Kituku    vkituku@gmail.com    33
1  Cynthia   Kituku    Ckituku@gmail.com    26
2   Eugene   Kituku    Ekituku@gmail.com    18
3    Chris  Schafer                 None    50
4      NaN      NaN                  NaN  None
5     None      NaN  anonymous@email.com  None
6      NaN      NaN                  NaN   NaN

In [8]:
df.dropna(axis='index', how = 'any')

     first  second              email age
0   Victor  Kituku  vkituku@gmail.com  33
1  Cynthia  Kituku  Ckituku@gmail.com  26
2   Eugene  Kituku  Ekituku@gmail.com  18

In [9]:
df.dropna(axis='index', how='all', subset=['email','second'])

     first   second                email   age
0   Victor   Kituku    vkituku@gmail.com    33
1  Cynthia   Kituku    Ckituku@gmail.com    26
2   Eugene   Kituku    Ekituku@gmail.com    18
3    Chris  Schafer                 None    50
5     None      NaN  anonymous@email.com  None

In [10]:
df.isna()

   first  second  email    age
0  False   False  False  False
1  False   False  False  False
2  False   False  False  False
3  False   False   True  False
4   True    True   True   True
5   True    True  False   True
6   True    True   True   True

In [11]:
df.isna().sum()

first     3
second    3
email     3
age       3
dtype: int64

In [12]:
df.fillna(0)

     first   second                email age
0   Victor   Kituku    vkituku@gmail.com  33
1  Cynthia   Kituku    Ckituku@gmail.com  26
2   Eugene   Kituku    Ekituku@gmail.com  18
3    Chris  Schafer                    0  50
4        0        0                    0   0
5        0        0  anonymous@email.com   0
6        0        0                    0   0

In [13]:
df.dtypes

first     object
second    object
email     object
age       object
dtype: object

In [15]:
df['age']

0      33
1      26
2      18
3      50
4    None
5    None
6     NaN
Name: age, dtype: object

In [ ]:
df['age'] = df['age'].astype(float)
df.dtypes

first      object
second     object
email      object
age       float64
dtype: object

In [ ]:
df['age'].mean()

31.75

In [ ]:
#Combining columns
df['first'] + ' ' + df['second']

0     Victor Kituku
1    Cynthia Kituku
2     Eugene Kituku
3     Chris Schafer
4               NaN
5               NaN
6               NaN
dtype: object

In [ ]:
df['Full_name'] = df['first'] + ' ' + df['second']
df

     first   second                email   age       Full name       Full_name
0   Victor   Kituku    vkituku@gmail.com  33.0   Victor Kituku   Victor Kituku
1  Cynthia   Kituku    Ckituku@gmail.com  26.0  Cynthia Kituku  Cynthia Kituku
2   Eugene   Kituku    Ekituku@gmail.com  18.0   Eugene Kituku   Eugene Kituku
3    Chris  Schafer                 None  50.0   Chris Schafer   Chris Schafer
4      NaN      NaN                  NaN   NaN             NaN             NaN
5     None      NaN  anonymous@email.com   NaN             NaN             NaN
6      NaN      NaN                  NaN   NaN             NaN             NaN